In [1]:
import pandas as pd

In [3]:
#딕셔너리 -> 시리즈 변환
dict_data = {'a':1,'b':2,'c':3}
sr= pd.Series(dict_data)
sr

a    1
b    2
c    3
dtype: int64

In [4]:
#리스트 -> 시리즈 변환
list_data = ['2019-01-02',3.14,'ABC',100,True]
sr=pd.Series(list_data)
sr

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [ ]:
#딕셔너리 -> DF 변환
dict_data = {'name':['Jerry','Riah','Paul'],
            'algol':['A','A+','B'],
            'basic':['C','B','B+'],
            'c++':['B+','C','C+']}
df= pd.DataFrame(dict_data)
df

In [10]:
#리스트 인덱싱, 슬라이싱
dict_data = {'a':1,'b':2,'c':3}
sr= pd.Series(dict_data)

sr1= sr['b']

sr2 = sr[1:2]

sr3 = sr['b':'c']
sr2

b    2
dtype: int64

In [11]:
#리스트 데이터프레임 만들기
list_data = [[15,'남','덕영중'],
            [17,'여','수리중'],
            [16,'여','연수중']]
df=pd.DataFrame(list_data)
df

    0  1    2
0  15  남  덕영중
1  17  여  수리중
2  16  여  연수중

In [12]:
#데이터프레임 행 & 인덱스 설정
df=pd.DataFrame(list_data,index=['준서','예은','길동'],columns=['나이','성별','학교'])
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중
길동  16  여  연수중

In [13]:
#예은이 행 삭제
df1 = df.drop('예은')
df1

    나이 성별   학교
준서  15  남  덕영중
길동  16  여  연수중

In [14]:
df #df1엔 예은이 제거된 데이터를 출력, 원래데이터는 그대로

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중
길동  16  여  연수중

In [15]:
df5= df.drop('성별',axis=1) #하나의 축이 모두 제거됨
df5

    나이   학교
준서  15  덕영중
예은  17  수리중
길동  16  연수중

In [16]:
#길동이 행 선택 슬라이싱
sr1 = df.loc['길동']
sr1

나이     16
성별      여
학교    연수중
Name: 길동, dtype: object

In [17]:
#두번째 행 선택 슬라이싱
sr2 = df.iloc[2]
sr2

나이     16
성별      여
학교    연수중
Name: 길동, dtype: object

In [18]:
#준서와 길동 슬라이싱
sr3 = df.loc[['준서','길동']]
sr3

    나이 성별   학교
준서  15  남  덕영중
길동  16  여  연수중

In [19]:
#준서~길동 나이~학교 슬라이싱(행,열 슬라이싱)
df3=df.loc['준서':'길동','나이':'학교']
df3

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중
길동  16  여  연수중

In [20]:
#df복사
df1 = df.copy()

In [21]:
df1['수학'] = 80 #수학점수 모두 일괄적으로 80점으로
df1

    나이 성별   학교  수학
준서  15  남  덕영중  80
예은  17  여  수리중  80
길동  16  여  연수중  80

In [22]:
df1['과학'] = [90,80,70] #과학점수 각자 90,80,70으로
df1

    나이 성별   학교  수학  과학
준서  15  남  덕영중  80  90
예은  17  여  수리중  80  80
길동  16  여  연수중  80  70

In [23]:
#희수 행추가
df1.loc['희수'] = [15,'남','반포중',100,95]
df1

    나이 성별   학교   수학  과학
준서  15  남  덕영중   80  90
예은  17  여  수리중   80  80
길동  16  여  연수중   80  70
희수  15  남  반포중  100  95

In [24]:
df1.loc['수연'] = df1.loc['예은'] #수연원소를 복사 예은에게 붙여넣기
df1

    나이 성별   학교   수학  과학
준서  15  남  덕영중   80  90
예은  17  여  수리중   80  80
길동  16  여  연수중   80  70
희수  15  남  반포중  100  95
수연  17  여  수리중   80  80

In [25]:
#예은 수학점수 원소값 변경
df1.loc['예은','수학'] = 75
df1

    나이 성별   학교   수학  과학
준서  15  남  덕영중   80  90
예은  17  여  수리중   75  80
길동  16  여  연수중   80  70
희수  15  남  반포중  100  95
수연  17  여  수리중   80  80

In [26]:
df1.iloc[1,4] = 75 #예은[1] 과학점수[4] 75로
df1

    나이 성별   학교   수학  과학
준서  15  남  덕영중   80  90
예은  17  여  수리중   75  75
길동  16  여  연수중   80  70
희수  15  남  반포중  100  95
수연  17  여  수리중   80  80

In [27]:
df1.loc['예은',['수학','과학']]=85,90 #예은의 과학 수학점수 각각 85,90으로 수정
df1

    나이 성별   학교   수학  과학
준서  15  남  덕영중   80  90
예은  17  여  수리중   85  90
길동  16  여  연수중   80  70
희수  15  남  반포중  100  95
수연  17  여  수리중   80  80